packages/botCasClient/botCasClient-21.9.22-py3-none-any.whl/botCasSP/views/v3_cas_saml_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header/>
	<SOAP-ENV:Body>
		<samlp:Request xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol" MajorVersion="1" MinorVersion="1" 
            RequestID="{{request_id}}" IssueInstant="{{issue_instant}}">
			<samlp:AssertionArtifact>{{ticket}}</samlp:AssertionArtifact>
		</samlp:Request>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>